---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.AnalyticalLoopType.Filled
enum: Autodesk.Revit.DB.Structure.AnalyticalLoopType
source: html/e19a91b9-b428-11a1-61a7-55296df56c2e.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLoopType.Filled

Loops that are filled inside.
 In the case of multiple nested loops, this will return the most external and every second loop going from external to internal.
 In the view, returned loops are presented as external outline of solids.